---
title: "Which tool should I use?"
date: 2007-07-06
forum: Absolute Beginner Talk
---

### Post by oli888 on 2007-07-06
I'm trying to use Ndiswrapper to set up my internet connection.

I have the .sys file but not the .inf file, but I do have a .in_ file.

I believe that the .inf file is a driver. When I open it in a text editor, I get:

[HTML];USR-ACTNNIC.inf
;***********************************************************************
;
; BELNIC.INF
;
;   This installation script supports Windows 98,Me,2000 & XP for the
;   Belkin 11Mbps Wireless LAN Adapters.
;
;   Copyright (c) 2002 Belkin Components
;   All Rights Reserved.
;   Developed by Belkin Components. -- http://www.belkin.com
;
;***********************************************************************

[Version]
 DriverVer = 03/13/2002, 1.31.0313.2002
 Signature           = "$Chicago$"
 Compatible          = 1
 Class               = Net
 ClassGUID           = {4d36e972-e325-11ce-bfc1-08002be10318}
 Provider            = %VER_VENDOR_STR%
;CatalogFile         = BELNIC.cat
;MillenniumPreferred = .ME

[ControlFlags]
;Exclude all PNP adapters from user selection
 ExcludeFromSelect   = PCMCIA\Belkin-11Mbps_Wireless_Notebook_Network_Adapter-3D8C
 ExcludeFromSelect   = PCI\VEN_1638&DEV_1100&SUBSYS_11001638
 ExcludeFromSelect   = PCI\VEN_1260&DEV_3873&SUBSYS_06011799

[Manufacturer]
 %VER_VENDOR_NAME_STR% = DeviceList,NTx86.5.1

[DeviceList]
 %PRISM_PCMCIA1_STR% = PRISM_PCMCIA1, PCMCIA\Belkin-11Mbps_Wireless_Notebook_Network_Adapter-3D8C
 %PRISM_PCI1_STR%    = PRISM_PCI1,    PCI\VEN_1638&DEV_1100&SUBSYS_11001638
 %PRISM_PCI2_STR%    = PRISM_PCI2,    PCI\VEN_1260&DEV_3873&SUBSYS_06011799

[DeviceList.NTx86.5.1]
 %PRISM_PCMCIA1_STR% = PRISM_PCMCIA1_XP, PCMCIA\Belkin-11Mbps_Wireless_Notebook_Network_Adapter-3D8C
 %PRISM_PCI1_STR%    = PRISM_PCI1_XP,    PCI\VEN_1638&DEV_1100&SUBSYS_11001638
 %PRISM_PCI2_STR%    = PRISM_PCI2_XP,    PCI\VEN_1260&DEV_3873&SUBSYS_06011799

;==========================================
[PRISM_PCMCIA1]         ; Win9x
 AddReg         = PRISM_PCMCIA1.reg, COMMON_PCMCIA.reg, COMMON_NDIS.reg, COMMON.reg

[PRISM_PCMCIA1.NT]      ; Win2k
 AddReg         = PRISM_PCMCIA1.reg, COMMON_PCMCIA.reg, COMMON_NDIS.reg.NT, COMMON.reg
 
 BusType        = 8     ; PCMCIA
 Characteristics= 0x84  ; NCF_PHYSICAL | NCF_HAS_UI

[PRISM_PCMCIA1.NT.Services]
 AddService     = "BEL", 2, PRISM_DRIVER.Service, PRISM_DRIVER.EventLog

[PRISM_PCMCIA1.NT.CoInstallers]
 
 AddReg         = PRISM_COINSTALL.reg.NT

[PRISM_PCMCIA1.reg]
 HKR,Ndi        ,DeviceID,0,"PCMCIA\Belkin-11Mbps_Wireless_Notebook_Network_Adapter-3D8C"

;==========================================
[PRISM_PCI1]            ; Win9x
 AddReg         = PRISM_PCI1.reg, COMMON_PCI.reg, COMMON_NDIS.reg, COMMON.reg
 

[PRISM_PCI1.NT]         ; Win2k
 AddReg         = PRISM_PCI1.reg, COMMON_PCI.reg, COMMON_NDIS.reg.NT, COMMON.reg
 
 BusType        = 5     ; PCI
 Characteristics= 0x84  ; NCF_PHYSICAL | NCF_HAS_UI

[PRISM_PCI1.NT.Services]
 AddService     = "BEL", 2, PRISM_DRIVER.Service, PRISM_DRIVER.EventLog

[PRISM_PCI1.NT.CoInstallers]
 
 AddReg         = PRISM_COINSTALL.reg.NT

[PRISM_PCI1.reg]
 HKR,Ndi        ,DeviceID,0,"PCI\VEN_1638&DEV_1100&SUBSYS_11001638"

;==========================================
[PRISM_PCI2]            ; Win9x
 AddReg         = PRISM_PCI2.reg, COMMON_PCI.reg, COMMON_NDIS.reg, COMMON.reg
 

[PRISM_PCI2.NT]         ; Win2k
 AddReg         = PRISM_PCI2.reg, COMMON_PCI.reg, COMMON_NDIS.reg.NT, COMMON.reg
 
 BusType        = 5     ; PCI
 Characteristics= 0x84  ; NCF_PHYSICAL | NCF_HAS_UI

[PRISM_PCI2.NT.Services]
 AddService     = "BEL", 2, PRISM_DRIVER.Service, PRISM_DRIVER.EventLog

[PRISM_PCI2.NT.CoInstallers]
 
 AddReg         = PRISM_COINSTALL.reg.NT

[PRISM_PCI2.reg]
 HKR,Ndi        ,DeviceID,0,"PCI\VEN_1638&DEV_1100&SUBSYS_11001638"

;==========================================
[PRISM_PCMCIA1_XP]      ; WinXP
 AddReg         = PRISM_PCMCIA1_XP.reg, COMMON_PCMCIA.reg, COMMON_NDIS.reg.NT, COMMON.reg
 
 BusType        = 8     ; PCMCIA
 Characteristics= 0x84  ; NCF_PHYSICAL | NCF_HAS_UI

[PRISM_PCMCIA1_XP.Services]
 AddService     = "BEL", 2, PRISM_DRIVER.Service, PRISM_DRIVER.EventLog

[PRISM_PCMCIA1_XP.CoInstallers]
 
 AddReg         = PRISM_COINSTALL.reg.XP

[PRISM_PCMCIA1_XP.reg]
 HKR,Ndi        ,DeviceID,0,"PCMCIA\Belkin-11Mbps_Wireless_Notebook_Network_Adapter-3D8C"

;==========================================
[PRISM_PCI1_XP]         ; WinXP
 AddReg         = PRISM_PCI1_XP.reg, COMMON_PCI.reg, COMMON_NDIS.reg.NT, COMMON.reg
 
 BusType        = 5     ; PCI
 Characteristics= 0x84  ; NCF_PHYSICAL | NCF_HAS_UI

[PRISM_PCI1_XP.Services]
 AddService     = "BEL", 2, PRISM_DRIVER.Service, PRISM_DRIVER.EventLog

[PRISM_PCI1_XP.CoInstallers]
 
 AddReg         = PRISM_COINSTALL.reg.XP

[PRISM_PCI1_XP.reg]
 HKR,Ndi        ,DeviceID,0,"PCI\VEN_1638&DEV_1100&SUBSYS_11001638"

;==========================================
[PRISM_PCI2_XP]         ; WinXP
 AddReg         = PRISM_PCI2_XP.reg, COMMON_PCI.reg, COMMON_NDIS.reg.NT, COMMON.reg
 
 BusType        = 5     ; PCI
 Characteristics= 0x84  ; NCF_PHYSICAL | NCF_HAS_UI

[PRISM_PCI2_XP.Services]
 AddService     = "BEL", 2, PRISM_DRIVER.Service, PRISM_DRIVER.EventLog

[PRISM_PCI2_XP.CoInstallers]
 
 AddReg         = PRISM_COINSTALL.reg.XP

[PRISM_PCI2_XP.reg]
 HKR,Ndi        ,DeviceID,0,"PCI\VEN_1638&DEV_1100&SUBSYS_11001638"

;###############################################################################

[PRISM_COINSTALL.reg.NT]
 HKR,           ,CoInstallers32         ,0x00010000     ,"BELCFG.cpl,NdiProc"

[PRISM_COINSTALL.reg.XP]
 HKR,           ,CoInstallers32         ,0x00010000     ,"BELCFG.cpl,NdiProc"

[PRISM_DRIVER.Service]
 DisplayName    = %PRISM_SERVICE_DISPLAY%
 ServiceType    = 1    ; SERVICE_KERNEL_DRIVER
 StartType      = 3    ; SERVICE_DEMAND_START
 ErrorControl   = 1    ; NORMAL
 ServiceBinary  = %12%\BELNDS.sys
 LoadOrderGroup = NDIS

[PRISM_DRIVER.EventLog]
 AddReg         = PRISM_DRIVER.EventLog.reg

[PRISM_DRIVER.EventLog.reg]
 HKR,           ,EventMessageFile       ,0x00020000     ,"%%SystemRoot%%\System32\netevent.dll"
 HKR,           ,TypesSupported         ,0x00010001     ,7

;###############################################################################
[COMMON_PCMCIA.reg]
;RegKey,SubKey          ,Name                   ,Type   ,Value
;-------------          -----                   -----   ------
 HKR,NDI                ,Service                ,0      ,"BEL"
 HKR,NDI                ,CardType               ,0      ,"PCMCIA"
 HKR,                   ,BusType                ,0      ,"8"
 HKR,                   ,DeviceVxDs             ,0      ,"BELNDS.sys"
 HKR,                   ,EnableIRQSharing       ,1      ,01,00,00,00
 HKR,                   ,IOBaseAddress          ,1      ,02,00,00,00
 HKR,                   ,InterruptNumber        ,1      ,04,00,00,00

[COMMON_PCI.reg]
 HKR,NDI                ,Service                ,0      ,"BEL"
 HKR,NDI                ,CardType               ,0      ,"PCI"
 HKR,                   ,BusType                ,0      ,"5"
 HKR,                   ,DeviceVxDs             ,0      ,"BELNDS.sys"
 HKR,                   ,EnableIRQSharing       ,1      ,01,00,00,00
 HKR,                   ,IOBaseAddress          ,1      ,02,00,00,00
 HKR,                   ,InterruptNumber        ,1      ,04,00,00,00

[COMMON_NDIS.reg]
 HKR,                   ,RunningWin9X           ,0      ,"1"
 HKR,                   ,DevLoader              ,0      ,"*ndis"
 HKR,                   ,EnumPropPages          ,0      ,"netdi.dll,EnumPropPages"
 HKR,NDI                ,NdiInstaller           ,0      ,"BELCFG.dll,NdiProc"
 HKR,NDI\Interfaces     ,UpperRange             ,0      ,"ndis3"
 HKR,NDI\Interfaces     ,LowerRange             ,0      ,"ethernet"
 HKR,NDI\Interfaces     ,DefUpper               ,0      ,"ndis3"
 HKR,NDI\Interfaces     ,DefLower               ,0      ,"ethernet"
 HKR,NDIS               ,LogDriverName          ,0      ,"BEL"
 HKR,NDIS               ,MajorNdisVersion       ,1      ,03
 HKR,NDIS               ,MinorNdisVersion       ,1      ,0a

 HKR,defaults,PSMode,0,1
 HKR,Ndi\params\PSMode,default,0,1
 HKR,NDI\params\PSMode,ParamDesc,,%POWER_SAVE_STR%
 HKR,NDI\params\PSMode,type,,enum
 HKR,NDI\params\PSMode,flag,1,30,00,00,00
 HKR,NDI\params\PSMode\enum,1,,"Disable"
 HKR,NDI\params\PSMode\enum,2,,"Always Enable"
 HKR,NDI\params\PSMode,optional,0,1

[COMMON_NDIS.reg.NT]
 HKR,                   ,EnumPropPages32        ,0      ,"BELCFG.cpl,NetPropPageProvider"
 HKR,NDI\Interfaces     ,UpperRange             ,0      ,"ndis5"
 HKR,NDI\Interfaces     ,LowerRange             ,0      ,"ethernet"

 HKR,defaults,PSMode,0,1
 HKR,Ndi\params\PSMode,default,0,1
 HKR,NDI\params\PSMode,ParamDesc,,%POWER_SAVE_STR%
 HKR,NDI\params\PSMode,type,,enum
 HKR,NDI\params\PSMode,flag,1,30,00,00,00
 HKR,NDI\params\PSMode\enum,1,,"Disable"
 HKR,NDI\params\PSMode\enum,2,,"Always Enable"
 HKR,NDI\params\PSMode\enum,3,,"Auto Enable"
 HKR,NDI\params\PSMode,optional,0,1

[COMMON.reg]
 HKR,                   ,BELIOC               ,0      ,"1"
 HKR,                   ,SilentInstall          ,0      ,"1"
;Uncomment the line above to install without user interface prompts

 HKR,defaults,ListenInterval,0,3
 HKR,Ndi\params\ListenInterval,default,0,3
 HKR,NDI\params\ListenInterval,ParamDesc,,%LISTENINTERVAL_STR%
 HKR,NDI\params\ListenInterval,type,,int
 HKR,NDI\params\ListenInterval,flag,1,30,00,00,00
 HKR,NDI\params\ListenInterval,min,0,0
 HKR,NDI\params\ListenInterval,max,0,77
 HKR,NDI\params\ListenInterval,step,0,1
 HKR,NDI\params\ListenInterval,optional,0,1

 HKR,defaults,RTSThresh,0,2432
 HKR,Ndi\params\RTSThresh,default,0,2432
 HKR,NDI\params\RTSThresh,ParamDesc,0,%RTSTHRESH_STR%
 HKR,NDI\params\RTSThresh,type,0,int
 HKR,NDI\params\RTSThresh,flag,1,20,00,00,00
 HKR,NDI\params\RTSThresh,min,0,0
 HKR,NDI\params\RTSThresh,max,0,2432
 HKR,NDI\params\RTSThresh,step,0,64
 HKR,NDI\params\RTSThresh,optional,0,1

 HKR,defaults,FragThresh,0,2432
 HKR,Ndi\params\FragThresh,default,0,2432
 HKR,NDI\params\FragThresh,ParamDesc,0,%FRAGTHRESH_STR%
 HKR,NDI\params\FragThresh,type,0,int
 HKR,NDI\params\FragThresh,flag,1,20,00,00,00
 HKR,NDI\params\FragThresh,min,0,256
 HKR,NDI\params\FragThresh,max,0,2432
 HKR,NDI\params\FragThresh,step,0,128
 HKR,NDI\params\FragThresh,optional,0,1

 HKR,defaults,PreambleMode,0,1
 HKR,Ndi\params\PreambleMode,default,0,1
 HKR,NDI\params\PreambleMode,ParamDesc,,%SHORT_PREAM_STR%
 HKR,NDI\params\PreambleMode,type,,enum
 HKR,NDI\params\PreambleMode,flag,1,30,00,00,00
 HKR,NDI\params\PreambleMode\enum,1,,"Long Tx Preamble"
 HKR,NDI\params\PreambleMode\enum,2,,"Short Tx Preamble"
 HKR,NDI\params\PreambleMode\enum,3,,"Auto Tx Preamble"
 HKR,NDI\params\PreambleMode,optional,0,1

 HKR,defaults,AuthentAlg,0,65535
 HKR,NDI\params\AuthentAlg,default,0,65535
 HKR,NDI\params\AuthentAlg,ParamDesc,,%AUTHENT_TYPE_STR%
 HKR,NDI\params\AuthentAlg,type,,enum
 HKR,NDI\params\AuthentAlg,flag,1,30,00,00,00
 HKR,NDI\params\AuthentAlg\enum,1,,"WECA Compliant (always use Open)"
 HKR,NDI\params\AuthentAlg\enum,2,,"Must use Shared with WEP"
 HKR,NDI\params\AuthentAlg\enum,65535,,"Automatic based on WEP setting"
 HKR,NDI\params\AuthentAlg,optional,0,1

 HKR,defaults,AdhocDemoMode,0,0
 HKR,Ndi\params\AdhocDemoMode,default,0,0
 HKR,NDI\params\AdhocDemoMode,ParamDesc,,%ADHOC_DEMO_STR%
 HKR,NDI\params\AdhocDemoMode,type,,enum
 HKR,NDI\params\AdhocDemoMode,flag,1,30,00,00,00
 HKR,NDI\params\AdhocDemoMode\enum,0,,"Disable"
 HKR,NDI\params\AdhocDemoMode\enum,1,,"Enable"
 HKR,NDI\params\AdhocDemoMode,optional,0,1

;###############################################################################
[DestinationDirs]
;CopyFiles Section      = Destination Directory ID -- see layout.inf
;-----------------        ------------------------
 DefaultDestDir         = 11 ; Win9x=%windir%\system Win2k=%windir%\system32

[SourceDisksNames]
;Source Disk ID         = Disk Name
;--------------           ---------
 1                      = %INSTALL_DISK_STR%,,,

;###############################################################################
[Strings]
;String ID              = String Text
;---------                -----------
 VER_VENDOR_STR         = "Belkin"
 VER_VENDOR_NAME_STR    = "Belkin Components"

 PRISM_PCMCIA1_STR      = "Belkin 11Mbps Wireless Notebook Network Adapter"
 PRISM_PCI1_STR         = "Belkin 11Mbps Wireless PCI Adapter Card"
 PRISM_PCI2_STR         = "Belkin 11Mbps Wireless Desktop PCI Adapter Card"

 PRISM_SERVICE_DISPLAY  = "Belkin 11Mbps Wireless LAN Driver"
 INSTALL_DISK_STR       = "Belkin 11Mbps Wireless LAN Install Disk"

 ADHOC_DEMO_STR         = "Adhoc Demo Mode"
 SHORT_PREAM_STR        = "Preamble Mode"
 RTSTHRESH_STR          = "RTS Threshold"
 FRAGTHRESH_STR         = "Fragmentation Threshold"
 AUTHENT_TYPE_STR       = "Authentication Algorithm"
 LISTENINTERVAL_STR     = "Listen Interval"
 POWER_SAVE_STR         = "Power Save Mode"
 POWER_LEVEL_STR        = "Power Save Level"

[/HTML]

I think there is a way to somehow extract .in_ files to .inf files. Does anybody konw how I can make a .inf file out of this. I can use either Linux or Windows.

Thanks for the help,

Oliver

---

### Post by reckless2k2 on 2007-07-06
copy the inf files from your windows install or if it's dual boot point to the location of the drivers in the windows partition. if you have the driver cd, copy the inf from there. if not, google the driver and you'll more than likely get the zip file with all the drivers and then copy to drive and point from there.

---

### Post by oli888 on 2007-07-06
Thankyou for your reply.

I am using the Windows drivers. The problem is that I cannot find a .inf file. There are .sys files and there is the .in_ file that I posted above.

I've searched for drivers and the only one available is Belkin's driver which doesn't seem to contain a .inf file,only .sys and .inf files. I've tried extracting .cab files but I couldn't find anything in them.

The card is a Belkin F5D6020 version 1. The ver 2 and ver3 cards use a different chipset so they need different drivers.

Thanks if anybody can provide help,

Oliver

---

### Post by kwacka on 2007-07-06
In windows use the command line:

 cabarc x whatever.in_

to produce the 'whatever.inf' file  (the option 'x' extracts files) in a new folder.

Alternatively use the windows search facility to see if the 'whatever.inf' file is stored in the Windows system files.

Finally, there's a chance that it might not be compressed - try renaming the .in_ file to .inf ans see if it installs.

---

